In [1]:
import numpy as np
import pandas as pd
pd.__version__

'1.1.1'

In [2]:
pd.DataFrame(np.random.randint(2, 12),columns=['a', 'b'],index=range(5))

   a  b
0  5  5
1  5  5
2  5  5
3  5  5
4  5  5

In [3]:
i = pd.Index(range(0,5,2))
i

RangeIndex(start=0, stop=5, step=2)

In [4]:
for j in i:
    print(j)
print(i[::],"\nNegative: ",i[-1])

0
2
4
RangeIndex(start=0, stop=6, step=2)
Negative:  4

In [5]:
print("Size: {}\nShape: {}\nDimension: {}\nType: {}".format(i.size, i.shape, i.ndim, i.dtype))

Size: 3
Shape: (3,)
Dimension: 1
Type: int64

In [6]:
#They're immutable
i[1] = 3

TypeError: Index does not support mutable operations

In [7]:
r = np.random.RandomState(10)
a = pd.Series(r.randint(0, 20, 6))
a

0     9
1     4
2    15
3     0
4    17
5    16
dtype: int32

In [11]:
df = pd.DataFrame(r.randint(0, 20, (9, 5)), columns=['A', 'B', 'C', 'D', 'E'])
df

    A   B   C   D   E
0  17   8   9   0  10
1   8   4  19  16   4
2  15  11  11   1   8
3   4  14  17  19  13
4   5  13  19  13  12
5   1   4  18  13  11
6  10   9  15  18  16
7   7  11  17  14   7
8  11   1   0  12   5

In [12]:
np.exp(a)

0    8.103084e+03
1    5.459815e+01
2    3.269017e+06
3    1.000000e+00
4    2.415495e+07
5    8.886111e+06
dtype: float64

In [13]:
np.tan(df*4)

          A         B         C         D         E
0 -2.040082  0.661006  7.750471  0.000000 -1.117215
1  0.661006  0.300632  0.686748  2.347860  0.300632
2  0.320040  0.017705  0.017705  1.157821  0.661006
3  0.300632 -0.611274 -2.040082  0.686748 -6.053272
4  2.237161 -6.053272  0.686748 -6.053272  1.200127
5  1.157821  0.300632 -0.262417 -6.053272  0.017705
6 -1.117215  7.750471  0.320040 -0.262417  2.347860
7 -0.281430  0.017705 -2.040082 -0.611274 -0.281430
8  0.017705  1.157821  0.000000  1.200127  2.237161

In [14]:
#Index alignment in Series
weight = pd.Series([113, 54, 84, 58], 
                   index=['Max', 'Anuj', 'Arindam', 'Praveen'], name='Weight')
weight_dict = {'Max': 113, 'Praveen': 58, 'Iftar': 56, 'Anuj': 54}
weight_dict = pd.Series(weight_dict, name='Weight dict')
print(weight,"\n\n",weight_dict)

Max        113
Anuj        54
Arindam     84
Praveen     58
Name: Weight, dtype: int64

 Max        113
Praveen     58
Iftar       56
Anuj        54
Name: Weight dict, dtype: int64

In [15]:
weight+weight_dict

Anuj       108.0
Arindam      NaN
Iftar        NaN
Max        226.0
Praveen    116.0
dtype: float64

In [16]:
weight-weight_dict

Anuj       0.0
Arindam    NaN
Iftar      NaN
Max        0.0
Praveen    0.0
dtype: float64

In [17]:
weight/weight_dict

Anuj       1.0
Arindam    NaN
Iftar      NaN
Max        1.0
Praveen    1.0
dtype: float64

In [18]:
weight**weight_dict

Anuj        3.542118e+93
Arindam              NaN
Iftar                NaN
Max        9.950940e+231
Praveen    1.900306e+102
dtype: float64

In [19]:
#Union
weight.index | weight_dict.index

Index(['Anuj', 'Arindam', 'Iftar', 'Max', 'Praveen'], dtype='object')

In [20]:
#Intersection
weight.index & weight_dict.index

Index(['Max', 'Anuj', 'Praveen'], dtype='object')

In [21]:
weight.add(weight_dict, fill_value=0.0)

Anuj       108.0
Arindam     84.0
Iftar       56.0
Max        226.0
Praveen    116.0
dtype: float64

In [22]:
df = pd.DataFrame({"Name": ['Max', 'Anuj', 'Arindam', 'Praveen'],
                  'Weight': [34, 67, 39, 15],})
df

      Name  Weight
0      Max      34
1     Anuj      67
2  Arindam      39
3  Praveen      15

In [23]:
df2 = pd.DataFrame({'Name': ['Max','Anuj','Manvi','Praveen'],
                    'Weight': [34, 67, 39, 15], 
                    'Age': [12,23,34,13]})
df2

      Name  Weight  Age
0      Max      34   12
1     Anuj      67   23
2    Manvi      39   34
3  Praveen      15   13

In [24]:
df2.merge(df)

      Name  Weight  Age
0      Max      34   12
1     Anuj      67   23
2  Praveen      15   13

In [42]:
#Join
print("Inner: \n",df.merge(df2, how='inner'), "\n"+":"*25)
print("Outer: \n",df.merge(df2, how='outer'), "\n"+":"*25)
print("Left: \n",df.merge(df2, how='left'), "\n"+":"*25)
print("Right: \n",df.merge(df2, how='right'), "\n"+":"*25)

Inner:
       Name  Weight  Age
0      Max      34   12
1     Anuj      67   23
2  Praveen      15   13
:::::::::::::::::::::::::
Outer:
       Name  Weight   Age
0      Max      34  12.0
1     Anuj      67  23.0
2  Arindam      39   NaN
3  Praveen      15  13.0
4    Manvi      39  34.0
:::::::::::::::::::::::::
Left:
       Name  Weight   Age
0      Max      34  12.0
1     Anuj      67  23.0
2  Arindam      39   NaN
3  Praveen      15  13.0
:::::::::::::::::::::::::
Right:
       Name  Weight  Age
0      Max      34   12
1     Anuj      67   23
2    Manvi      39   34
3  Praveen      15   13
:::::::::::::::::::::::::

In [58]:
A = pd.Series([np.nan, 0, 0, np.nan, 0, np.nan])
B = pd.Series([1]*6)
print(A,"\n\n",B)

0    NaN
1    0.0
2    0.0
3    NaN
4    0.0
5    NaN
dtype: float64

 0    1
1    1
2    1
3    1
4    1
5    1
dtype: int64

In [59]:
pd.Series(np.where(pd.isnull(A), B, A))

0    1.0
1    0.0
2    0.0
3    1.0
4    0.0
5    1.0
dtype: float64

In [60]:
A.combine_first(B)

0    1.0
1    0.0
2    0.0
3    1.0
4    0.0
5    1.0
dtype: float64